Ran Plan for project: `dev` dir: `terragrunt-integration/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
>>>> PLANNING CHANGES <<<<

/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/29/default/terragrunt-integration/terraform

23:48:38.452 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


23:48:38.479 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/dfHSk9Vmu6VjQdwNNEIlYb5iiAk/gb9vQw4X6EtgGaLQD3ALmFWJ91E
23:48:38.499 INFO   [modules/random] terraform: Initializing the backend...
23:48:38.499 INFO   [modules/random] terraform: Initializing provider plugins...
23:48:38.499 INFO   [modules/random] terraform: - Finding latest version of hashicorp/random...
23:48:38.500 INFO   terraform: Initializing the backend...
23:48:38.501 INFO   terraform: Initializing provider plugins...
23:48:38.501 INFO   terraform: - Finding latest version of hashicorp/random...
23:48:39.989 INFO   terraform: - Installing hashicorp/random v3.7.2...
23:48:39.989 INFO   [modules/random] terraform: - Installing hashicorp/random v3.7.2...
23:48:41.001 INFO   [modules/random] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
23:48:41.001 INFO   [modules/random] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:48:41.001 INFO   [modules/random] terraform: selections it made above. Include this file in your version control repository
23:48:41.001 INFO   [modules/random] terraform: so that Terraform can guarantee to make the same selections by default when
23:48:41.001 INFO   [modules/random] terraform: you run "terraform init" in the future.
23:48:41.001 INFO   [modules/random] terraform: Terraform has been successfully initialized!
23:48:41.079 INFO   terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
23:48:41.079 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:48:41.079 INFO   terraform: selections it made above. Include this file in your version control repository
23:48:41.079 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
23:48:41.079 INFO   terraform: you run "terraform init" in the future.
23:48:41.079 INFO   terraform: Terraform has been successfully initialized!
23:48:41.121 STDOUT [modules/random] terraform: Terraform used the selected providers to generate the following execution
23:48:41.121 STDOUT [modules/random] terraform: plan. Resource actions are indicated with the following symbols:
23:48:41.121 STDOUT [modules/random] terraform:   + create
23:48:41.121 STDOUT [modules/random] terraform: Terraform will perform the following actions:
23:48:41.121 STDOUT [modules/random] terraform:   # random_string.base_bucket_name will be created
23:48:41.121 STDOUT [modules/random] terraform:   + resource "random_string" "base_bucket_name" {
23:48:41.121 STDOUT [modules/random] terraform:       + id          = (known after apply)
23:48:41.121 STDOUT [modules/random] terraform:       + length      = 4
23:48:41.121 STDOUT [modules/random] terraform:       + lower       = true
23:48:41.121 STDOUT [modules/random] terraform:       + min_lower   = 0
23:48:41.121 STDOUT [modules/random] terraform:       + min_numeric = 0
23:48:41.121 STDOUT [modules/random] terraform:       + min_special = 0
23:48:41.121 STDOUT [modules/random] terraform:       + min_upper   = 0
23:48:41.121 STDOUT [modules/random] terraform:       + number      = false
23:48:41.121 STDOUT [modules/random] terraform:       + numeric     = false
23:48:41.121 STDOUT [modules/random] terraform:       + result      = (known after apply)
23:48:41.121 STDOUT [modules/random] terraform:       + special     = false
23:48:41.121 STDOUT [modules/random] terraform:       + upper       = false
23:48:41.121 STDOUT [modules/random] terraform:     }
23:48:41.121 STDOUT [modules/random] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:48:41.121 STDOUT [modules/random] terraform: 
23:48:41.121 STDOUT [modules/random] terraform: Changes to Outputs:
23:48:41.121 STDOUT [modules/random] terraform:   + base_bucket_name = (known after apply)
23:48:41.200 STDOUT terraform: Terraform used the selected providers to generate the following execution
23:48:41.200 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
23:48:41.200 STDOUT terraform:   + create
23:48:41.200 STDOUT terraform: Terraform will perform the following actions:
23:48:41.200 STDOUT terraform:   # random_string.base_bucket_name will be created
23:48:41.200 STDOUT terraform:   + resource "random_string" "base_bucket_name" {
23:48:41.200 STDOUT terraform:       + id          = (known after apply)
23:48:41.200 STDOUT terraform:       + length      = 4
23:48:41.200 STDOUT terraform:       + lower       = true
23:48:41.200 STDOUT terraform:       + min_lower   = 0
23:48:41.200 STDOUT terraform:       + min_numeric = 0
23:48:41.200 STDOUT terraform:       + min_special = 0
23:48:41.200 STDOUT terraform:       + min_upper   = 0
23:48:41.200 STDOUT terraform:       + number      = false
23:48:41.200 STDOUT terraform:       + numeric     = false
23:48:41.200 STDOUT terraform:       + result      = (known after apply)
23:48:41.200 STDOUT terraform:       + special     = false
23:48:41.200 STDOUT terraform:       + upper       = false
23:48:41.200 STDOUT terraform:     }
23:48:41.200 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:48:41.200 STDOUT terraform: 
23:48:41.200 STDOUT terraform: Changes to Outputs:
23:48:41.200 STDOUT terraform:   + base_bucket_name = (known after apply)
23:48:41.208 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/dfHSk9Vmu6VjQdwNNEIlYb5iiAk/gb9vQw4X6EtgGaLQD3ALmFWJ91E
23:48:41.231 INFO   terraform: Initializing the backend...
23:48:41.241 INFO   terraform: Initializing provider plugins...
23:48:41.241 INFO   terraform: - Reusing previous version of hashicorp/random from the dependency lock file
23:48:41.363 INFO   terraform: - Using previously-installed hashicorp/random v3.7.2
23:48:41.363 INFO   terraform: Terraform has been successfully initialized!
23:48:41.400 WARN   [app2] Config ./commons.hcl is a dependency of ./app2/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
23:48:41.400 WARN   [app1] Config ./commons.hcl is a dependency of ./app1/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
23:48:41.401 INFO   [app2] Downloading Terraform configurations from ./modules/s3-bucket into ./app2/.terragrunt-cache/6_oCQyrtH1BvATjcmKRc0k8X2Tw/6I_o99KCJmHe_VRgNgi-PQC4584
23:48:41.401 INFO   [app1] Downloading Terraform configurations from ./modules/s3-bucket into ./app1/.terragrunt-cache/sAk3VhiCmW8B5Fwh6wgCrxb9MpY/6I_o99KCJmHe_VRgNgi-PQC4584
23:48:41.423 INFO   [app1] terraform: Initializing the backend...
23:48:41.423 INFO   [app2] terraform: Initializing the backend...
23:48:41.423 INFO   [app1] terraform: Initializing provider plugins...
23:48:41.423 INFO   [app1] terraform: - Finding hashicorp/aws versions matching "~> 5.0"...
23:48:41.423 INFO   [app2] terraform: Initializing provider plugins...
23:48:41.423 INFO   [app2] terraform: - Finding hashicorp/aws versions matching "~> 5.0"...
23:48:41.946 INFO   [app2] terraform: - Installing hashicorp/aws v5.100.0...
23:48:41.950 INFO   [app1] terraform: - Installing hashicorp/aws v5.100.0...
23:49:02.718 INFO   [app2] terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
23:49:02.718 INFO   [app2] terraform: Terraform has made some changes to the provider dependency selections recorded
23:49:02.718 INFO   [app2] terraform: in the .terraform.lock.hcl file. Review those changes and commit them to your
23:49:02.718 INFO   [app2] terraform: version control system if they represent changes you intended to make.
23:49:02.718 INFO   [app2] terraform: Terraform has been successfully initialized!
23:49:05.232 STDOUT [app2] terraform: Terraform used the selected providers to generate the following execution
23:49:05.232 STDOUT [app2] terraform: plan. Resource actions are indicated with the following symbols:
23:49:05.232 STDOUT [app2] terraform:   + create
23:49:05.232 STDOUT [app2] terraform: Terraform will perform the following actions:
23:49:05.232 STDOUT [app2] terraform:   # aws_s3_bucket.this will be created
23:49:05.232 STDOUT [app2] terraform:   + resource "aws_s3_bucket" "this" {
23:49:05.232 STDOUT [app2] terraform:       + acceleration_status         = (known after apply)
23:49:05.232 STDOUT [app2] terraform:       + acl                         = "private"
23:49:05.232 STDOUT [app2] terraform:       + arn                         = (known after apply)
23:49:05.232 STDOUT [app2] terraform:       + bucket                      = "app2-new-1-dev-base-name"
23:49:05.233 STDOUT [app2] terraform:       + bucket_domain_name          = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + bucket_prefix               = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + bucket_regional_domain_name = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + force_destroy               = false
23:49:05.233 STDOUT [app2] terraform:       + hosted_zone_id              = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + id                          = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + object_lock_enabled         = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + policy                      = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + region                      = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + request_payer               = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + tags_all                    = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + website_domain              = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + website_endpoint            = (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + cors_rule (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + grant (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + lifecycle_rule (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + logging (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + object_lock_configuration (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + replication_configuration (known after apply)
23:49:05.233 STDOUT [app2] terraform:       + server_side_encryption_configuration (known after apply)
23:49:05.234 STDOUT [app2] terraform:       + versioning (known after apply)
23:49:05.234 STDOUT [app2] terraform:       + website (known after apply)
23:49:05.234 STDOUT [app2] terraform:     }
23:49:05.234 STDOUT [app2] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:49:05.234 STDOUT [app2] terraform: 
23:49:05.234 STDOUT [app2] terraform: Changes to Outputs:
23:49:05.234 STDOUT [app2] terraform:   + bucket_arn = (known after apply)
23:49:05.234 STDOUT [app2] terraform: ╷
23:49:05.234 STDOUT [app2] terraform: │ Warning: Argument is deprecated
23:49:05.234 STDOUT [app2] terraform: │ 
23:49:05.234 STDOUT [app2] terraform: │   with aws_s3_bucket.this,
23:49:05.234 STDOUT [app2] terraform: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
23:49:05.234 STDOUT [app2] terraform: │   17:   acl    = "private"
23:49:05.234 STDOUT [app2] terraform: │ 
23:49:05.234 STDOUT [app2] terraform: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
23:49:05.234 STDOUT [app2] terraform: │ 
23:49:05.234 STDOUT [app2] terraform: │ (and one more similar warning elsewhere)
23:49:05.234 STDOUT [app2] terraform: ╵
23:49:06.482 INFO   [app1] terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
23:49:06.482 INFO   [app1] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:49:06.482 INFO   [app1] terraform: selections it made above. Include this file in your version control repository
23:49:06.482 INFO   [app1] terraform: so that Terraform can guarantee to make the same selections by default when
23:49:06.482 INFO   [app1] terraform: you run "terraform init" in the future.
23:49:06.482 INFO   [app1] terraform: Terraform has been successfully initialized!
23:49:08.910 STDOUT [app1] terraform: Terraform used the selected providers to generate the following execution
23:49:08.910 STDOUT [app1] terraform: plan. Resource actions are indicated with the following symbols:
23:49:08.910 STDOUT [app1] terraform:   + create
23:49:08.910 STDOUT [app1] terraform: Terraform will perform the following actions:
23:49:08.910 STDOUT [app1] terraform:   # aws_s3_bucket.this will be created
23:49:08.910 STDOUT [app1] terraform:   + resource "aws_s3_bucket" "this" {
23:49:08.911 STDOUT [app1] terraform:       + acceleration_status         = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + acl                         = "private"
23:49:08.911 STDOUT [app1] terraform:       + arn                         = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + bucket                      = "app1-new9-dev-base-name"
23:49:08.911 STDOUT [app1] terraform:       + bucket_domain_name          = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + bucket_prefix               = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + bucket_regional_domain_name = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + force_destroy               = false
23:49:08.911 STDOUT [app1] terraform:       + hosted_zone_id              = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + id                          = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + object_lock_enabled         = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + policy                      = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + region                      = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + request_payer               = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + tags_all                    = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + website_domain              = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + website_endpoint            = (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + cors_rule (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + grant (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + lifecycle_rule (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + logging (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + object_lock_configuration (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + replication_configuration (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + server_side_encryption_configuration (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + versioning (known after apply)
23:49:08.911 STDOUT [app1] terraform:       + website (known after apply)
23:49:08.911 STDOUT [app1] terraform:     }
23:49:08.911 STDOUT [app1] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
23:49:08.911 STDOUT [app1] terraform: 
23:49:08.911 STDOUT [app1] terraform: Changes to Outputs:
23:49:08.911 STDOUT [app1] terraform:   + bucket_arn = (known after apply)
23:49:08.911 STDOUT [app1] terraform: ╷
23:49:08.911 STDOUT [app1] terraform: │ Warning: Argument is deprecated
23:49:08.911 STDOUT [app1] terraform: │ 
23:49:08.912 STDOUT [app1] terraform: │   with aws_s3_bucket.this,
23:49:08.912 STDOUT [app1] terraform: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
23:49:08.912 STDOUT [app1] terraform: │   17:   acl    = "private"
23:49:08.912 STDOUT [app1] terraform: │ 
23:49:08.912 STDOUT [app1] terraform: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
23:49:08.912 STDOUT [app1] terraform: │ 
23:49:08.912 STDOUT [app1] terraform: │ (and one more similar warning elsewhere)
23:49:08.912 STDOUT [app1] terraform: ╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://890ca2a7b7e7.ngrok-free.app/lock?id=jefersonlemos%252Fatlantis-playground%252Fterragrunt-integration%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p dev
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```